import projectConfig from '/pagic.config.js';
export default {
    config: { "root": "/", ...projectConfig, branch: '' },
    'pagePath': "posts/campus_recruitment.md",
    'layoutPath': "posts/_layout.tsx",
    'outputPath': "posts/campus_recruitment.html",
    'title': "校招季",
    'content': React.createElement("article", { dangerouslySetInnerHTML: {
            __html: '<h1>校招季</h1>\n<p>一年一度的校招季快要结束了，同学们是不是拿 offer 拿到手软呢？</p>\n<p>今年我有幸参与了合肥南京和武汉的校招工作，忙碌之后终于有时间把这段珍贵的经历记录下来。</p>\n<h2 id="%E5%90%88%E8%82%A5">合肥<a class="anchor" href="#%E5%90%88%E8%82%A5">§</a></h2>\n<p>五个小时的高铁，迎接我们的是磅礴的大雨，人头攒动的火车站，灰蒙蒙的天空和脏兮兮的街道，一副拒人千里之外的模样。</p>\n<p>不愿多等，我们打上了一辆破旧的黑的，一路听着司机对这个城市的抱怨，来到了中科大附近的酒店。</p>\n<p>漫步在中科大的校园中，学生们有的行色匆匆，有的谈笑风生，有的搂搂抱抱，而我似乎是一个隔绝于世的观察者，站在另一个维度，看着世人的恩恩怨怨，但是实际上我只是一个无名小卒，没人认识我，也没人在乎我，世界之大，莫过于此。</p>\n<p>校招的过程，无外乎宣讲会，笔试，改卷，约面，一面，二面，终面，讨论，发 offer。曾经的我作为应聘者，未曾考虑，原来这竟是一个如此复杂，如此辛苦的过程，即使写满一本书，也未必能计划周全。</p>\n<p>热情高涨的同学们，挤满了一个又一个教室，两倍于预估数量的试卷摆在我们面前，即使改到凌晨三点，也仅仅完成一半。第二天从九点面试到晚上六点，也只有一杯一杯的咖啡，能够给我的脑袋带来些许的清醒。</p>\n<p>面试的感受，从刚开始的新鲜，到最后的机械，也只有亲身经历过的人，才能体会。当然也遇到形形色色的同学，有大牛也有小白，有怪客也有美眉，有初中开始获得无数竞赛奖项的，也有工作三年又来跨专业读研的。</p>\n<p>还记得看着同学在纸上写写画画，仿佛看到了他思维的火花，一次一次的点燃，碰撞，湮灭，最后得到正确答案的一瞬，我也可以和他一起分享这成功的喜悦了。也有熟谙算法的同学，向我抱怨出的题太简单。还有被面试官争抢的萌妹子（这里炫耀一下，能当前端的面试官真是一件被羡慕的事，因为前端是妹子最多的技术岗了）。</p>\n<p>每天超负荷的工作，也难怪听说去年参加校招的人，再也不想来了。经过三天的面试，最后终于离开了这个悲伤而混沌的城市，前往下一站，南京。</p>\n<h2 id="%E5%8D%97%E4%BA%AC">南京<a class="anchor" href="#%E5%8D%97%E4%BA%AC">§</a></h2>\n<p>南京是一个安静和秩序的城市，随处可见的小糖人吉祥物（砳砳，南京青奥会吉祥物），南大旁空空荡荡的街道，鸭血粉丝熟悉的味道。</p>\n<p>休息半天，和小伙伴一起游览了大屠杀纪念馆，中山陵和玄武湖，南京真是一个满载历史的城市。</p>\n<p>南大的同学们，水平普遍没有中科大高，但是因为去了三个学校笔试，所以工作量也是成倍的增长，身体也慢慢适应了这种超负荷的工作状态。进过3天的奋战，终于拖着疲惫的身躯回到了家。</p>\n<h2 id="%E6%AD%A6%E6%B1%89">武汉<a class="anchor" href="#%E6%AD%A6%E6%B1%89">§</a></h2>\n<p>武汉是我的家乡，这次也恰巧能够趁着校招机会，休息到十一。</p>\n<p>回到校园，和大学同学们小聚一番，回想起当年一起上课，一起 dota 的日子，颇有感伤，如今已物是人非，步入社会后，再也找不回当年的纯真和热血。</p>\n<p>比较有意思的是，面试到一些校友，还有同一个老师的学姐，给这次校招之旅带来了心灵的畅怀。</p>\n<h2 id="%E6%84%9F%E6%83%B3">感想<a class="anchor" href="#%E6%84%9F%E6%83%B3">§</a></h2>\n<p>这次校招之旅，付出身体的劳累，也收获了很多：</p>\n<ul>\n<li>巩固了基础知识</li>\n<li>丰富了面试经验</li>\n<li>结识了新的朋友</li>\n<li>锻炼了交流能力</li>\n</ul>\n<p>当然也存在不足之处：</p>\n<ul>\n<li>没有一个完善的记录</li>\n<li>基础还不够扎实</li>\n<li>判断还不够准确</li>\n</ul>\n<p>相信在之后的职业生涯中，这段经历会成为重要的一笔，对我的成长发挥更大的作用。</p>\n<h2 id="%E6%84%9F%E8%B0%A2">感谢<a class="anchor" href="#%E6%84%9F%E8%B0%A2">§</a></h2>\n<p>感谢增哥给我的这个锻炼自己的机会，感谢 hrmm 们辛苦的工作，感谢并肩战斗的同事们对我的关怀，最后感谢老婆和家人对我的支持！</p>'
        } }),
    'head': null,
    'script': React.createElement(React.Fragment, null,
        React.createElement("script", { src: "https://cdn.pagic.org/react@16.13.1/umd/react.production.min.js" }),
        React.createElement("script", { src: "https://cdn.pagic.org/react-dom@16.13.1/umd/react-dom.production.min.js" }),
        React.createElement("script", { src: "/index.js", type: "module" })),
    'contentTitle': React.createElement("h1", { key: "0" }, "\u6821\u62DB\u5B63"),
    'contentBody': React.createElement("article", { dangerouslySetInnerHTML: {
            __html: '<p>一年一度的校招季快要结束了，同学们是不是拿 offer 拿到手软呢？</p>\n<p>今年我有幸参与了合肥南京和武汉的校招工作，忙碌之后终于有时间把这段珍贵的经历记录下来。</p>\n<h2 id="%E5%90%88%E8%82%A5">合肥<a class="anchor" href="#%E5%90%88%E8%82%A5">§</a></h2>\n<p>五个小时的高铁，迎接我们的是磅礴的大雨，人头攒动的火车站，灰蒙蒙的天空和脏兮兮的街道，一副拒人千里之外的模样。</p>\n<p>不愿多等，我们打上了一辆破旧的黑的，一路听着司机对这个城市的抱怨，来到了中科大附近的酒店。</p>\n<p>漫步在中科大的校园中，学生们有的行色匆匆，有的谈笑风生，有的搂搂抱抱，而我似乎是一个隔绝于世的观察者，站在另一个维度，看着世人的恩恩怨怨，但是实际上我只是一个无名小卒，没人认识我，也没人在乎我，世界之大，莫过于此。</p>\n<p>校招的过程，无外乎宣讲会，笔试，改卷，约面，一面，二面，终面，讨论，发 offer。曾经的我作为应聘者，未曾考虑，原来这竟是一个如此复杂，如此辛苦的过程，即使写满一本书，也未必能计划周全。</p>\n<p>热情高涨的同学们，挤满了一个又一个教室，两倍于预估数量的试卷摆在我们面前，即使改到凌晨三点，也仅仅完成一半。第二天从九点面试到晚上六点，也只有一杯一杯的咖啡，能够给我的脑袋带来些许的清醒。</p>\n<p>面试的感受，从刚开始的新鲜，到最后的机械，也只有亲身经历过的人，才能体会。当然也遇到形形色色的同学，有大牛也有小白，有怪客也有美眉，有初中开始获得无数竞赛奖项的，也有工作三年又来跨专业读研的。</p>\n<p>还记得看着同学在纸上写写画画，仿佛看到了他思维的火花，一次一次的点燃，碰撞，湮灭，最后得到正确答案的一瞬，我也可以和他一起分享这成功的喜悦了。也有熟谙算法的同学，向我抱怨出的题太简单。还有被面试官争抢的萌妹子（这里炫耀一下，能当前端的面试官真是一件被羡慕的事，因为前端是妹子最多的技术岗了）。</p>\n<p>每天超负荷的工作，也难怪听说去年参加校招的人，再也不想来了。经过三天的面试，最后终于离开了这个悲伤而混沌的城市，前往下一站，南京。</p>\n<h2 id="%E5%8D%97%E4%BA%AC">南京<a class="anchor" href="#%E5%8D%97%E4%BA%AC">§</a></h2>\n<p>南京是一个安静和秩序的城市，随处可见的小糖人吉祥物（砳砳，南京青奥会吉祥物），南大旁空空荡荡的街道，鸭血粉丝熟悉的味道。</p>\n<p>休息半天，和小伙伴一起游览了大屠杀纪念馆，中山陵和玄武湖，南京真是一个满载历史的城市。</p>\n<p>南大的同学们，水平普遍没有中科大高，但是因为去了三个学校笔试，所以工作量也是成倍的增长，身体也慢慢适应了这种超负荷的工作状态。进过3天的奋战，终于拖着疲惫的身躯回到了家。</p>\n<h2 id="%E6%AD%A6%E6%B1%89">武汉<a class="anchor" href="#%E6%AD%A6%E6%B1%89">§</a></h2>\n<p>武汉是我的家乡，这次也恰巧能够趁着校招机会，休息到十一。</p>\n<p>回到校园，和大学同学们小聚一番，回想起当年一起上课，一起 dota 的日子，颇有感伤，如今已物是人非，步入社会后，再也找不回当年的纯真和热血。</p>\n<p>比较有意思的是，面试到一些校友，还有同一个老师的学姐，给这次校招之旅带来了心灵的畅怀。</p>\n<h2 id="%E6%84%9F%E6%83%B3">感想<a class="anchor" href="#%E6%84%9F%E6%83%B3">§</a></h2>\n<p>这次校招之旅，付出身体的劳累，也收获了很多：</p>\n<ul>\n<li>巩固了基础知识</li>\n<li>丰富了面试经验</li>\n<li>结识了新的朋友</li>\n<li>锻炼了交流能力</li>\n</ul>\n<p>当然也存在不足之处：</p>\n<ul>\n<li>没有一个完善的记录</li>\n<li>基础还不够扎实</li>\n<li>判断还不够准确</li>\n</ul>\n<p>相信在之后的职业生涯中，这段经历会成为重要的一笔，对我的成长发挥更大的作用。</p>\n<h2 id="%E6%84%9F%E8%B0%A2">感谢<a class="anchor" href="#%E6%84%9F%E8%B0%A2">§</a></h2>\n<p>感谢增哥给我的这个锻炼自己的机会，感谢 hrmm 们辛苦的工作，感谢并肩战斗的同事们对我的关怀，最后感谢老婆和家人对我的支持！</p>'
        } }),
    'toc': React.createElement("nav", { key: "0", className: "toc" },
        React.createElement("ol", null,
            React.createElement("li", null,
                React.createElement("a", { href: "#%E5%90%88%E8%82%A5" }, "\u5408\u80A5")),
            React.createElement("li", null,
                React.createElement("a", { href: "#%E5%8D%97%E4%BA%AC" }, "\u5357\u4EAC")),
            React.createElement("li", null,
                React.createElement("a", { href: "#%E6%AD%A6%E6%B1%89" }, "\u6B66\u6C49")),
            React.createElement("li", null,
                React.createElement("a", { href: "#%E6%84%9F%E6%83%B3" }, "\u611F\u60F3")),
            React.createElement("li", null,
                React.createElement("a", { href: "#%E6%84%9F%E8%B0%A2" }, "\u611F\u8C22")))),
    'author': undefined,
    'contributors': [],
    'date': "2014-11-03T00:00:00.000Z",
    'updated': null,
    'excerpt': "一年一度的校招季快要结束了，同学们是不是拿 offer 拿到手软呢？ 今年我有幸参与了合肥南京和武汉的校招工作，忙碌之后终于有时间把这段珍贵的经历记录下来。 合肥 五个小时的高铁，迎接我们的是磅礴的大雨，人头攒动的火车站...",
    'cover': undefined,
    'categories': [
        "多彩生活"
    ],
    'tags': [
        "校招"
    ],
    'blog': {
        "isPost": false,
        "posts": [],
        "categories": [],
        "tags": []
    }
};
